GAME_CONFIG = {
    # 1. 元数据 (在 'metadata' 键下)
    "metadata": {
        "game_id": "9",
        "source": "Pandakill Season 3, Episode 3",
        "game_rules": "", # 按要求：留空或手动填写规则
        "game_roles": [ # 填写此板子中的所有角色
            "预言家",
            "女巫",
            "守卫",
            "猎人",
            "狼人",
            "恶魔",
            "村民"
        ],
        "game_status": OrderedDict([ # 必须按时间顺序填写！
            ("first_night", "00:01:38,580"), # 游戏从SRT 00:00:00,120 开始
            ("sheiff_election", "00:01:38,580"), # 警长竞选从 SRT 00:03:35,500 开始 (第44条)
            ("first_day", "00:23:42,980"), # 第一个白天发言从 SRT 00:10:23,000 开始 (第89条)
            ("second_night", "01:10:56,750"), # 第二夜从 SRT 00:22:50,450 开始 (第180条)
            ("second_day", "01:11:09,530"), # 第二天从 SRT 00:23:03,490 开始 (第181条)
            ("third_night", "01:22:35,430"), # (估算值，基于第306条遗言结束)
            ("third_day", "01:22:53,960"),   # 第三天从 SRT 00:41:39,700 开始 (第310条)
            ("fourth_night", "01:24:47,560"), # (估算值，基于第306条遗言结束)
            ("fourth_day", "01:25:04,040"),   # 第三天从 SRT 00:41:39,700 开始 (第310条)
            ("end_time", "01:25:04,040") # 游戏在 SRT 00:49:36,630 结束 (第380条)
        ]),
        "user_aliases": { # SRT中的发言人ID -> 别名数组
            "说话人 1": ["host"], 
            "说话人 2": ["4号"],
            "说话人 3": ["11号"],
            "说话人 4": ["8号"],
            "说话人 5": ["9号"],
            "说话人 6": ["1号"],
            "说话人 7": ["3号"],
            "说话人 8": ["10号"],
            "说话人 9": ["4号"],
            "说话人 10": ["6号"],
            "说话人 11": ["7号"],
            "说话人 12": ["5号"], # 主持人
            "说话人 13": ["2号"],
            "说话人 14": ["12号"]
        },
        "real_role": { # (基于 SRT 第 381-382 条复盘)
            "说话人 1": "host",   
            "说话人 2": "狼人",   
            "说话人 3": "村民",   
            "说话人 4": "猎人",    
            "说话人 5": "狼人", 
            "说话人 6": "女巫",    
            "说话人 7": "村民",    
            "说话人 8": "守卫",  
            "说话人 9": "狼人",   
            "说话人 10": "预言家",   
            "说话人 11": "恶魔",    
            "说话人 12": "村民",    
            "说话人 13": "狼人",
            "说话人 14": "村民"    
        },
        "MVP": {
            "id": "7号",
            "votes": {
                "first_day_votes": {
                    "vote_to": "6号",
                    "cut_off_time": 539
                }
            }
        },
        "logs":"1 号是女巫，首晚使用解药救 5 号形成平安夜，白天跳身份号票出 7 号，第三晚被狼刀；2 号是狼人，一直站边 9 号并最终自爆；3 号是平民，井上站 6 号队且投错票；4 号是狼人并自爆；5 号是平民，首晚被狼刀后被 1 号救起；6 号是预言家，参与警长竞选时查杀 3 号，当选警长后被冲票出局，遗言建议女巫毒 9 号并将警徽飞给 12 号；7 号是恶魔，跳女巫冲掉真预言家；8 号是猎人，第三晚被狼刀；9 号是狼人，与 6 号对跳预言家并最终自爆；10 号是守卫，第二晚被狼刀；11 号是平民，参与警长竞选；12 号是平民，在 6 号出局后当选警长。" # 按要求：留空或手动填写
    },
    
    # 2. 警长任命 
    "sheriff_appointments": {
        "说话人 10": "00:22:48,920",
        "说话人 14": "01:10:29,240"
    },
    
    # 3. 摘要提取范围
    # (按要求：从第 381 条到第 398 条)
    "summary_id_range": (645, 650)
}