GAME_CONFIG = {
    # 1. 元数据 (在 'metadata' 键下)
    "metadata": {
        "game_id": "2",
        "source": "Pandakill Season 3, Episode 1",
        "game_rules": "", # 按要求：留空或手动填写规则
        "game_roles": [ # 填写此板子中的所有角色
            "预言家",
            "女巫",
            "猎人",
            "魔术师",
            "狼人",
            "村民"
        ],
        "game_status": OrderedDict([ # 必须按时间顺序填写！
            ("first_night", "00:00:53,810"), # 游戏从SRT 00:00:00,120 开始
            ("sheiff_election", "00:01:25,650"), # 警长竞选从 SRT 00:03:35,500 开始 (第44条)
            ("first_day", "00:09:23,720"), # 第一个白天发言从 SRT 00:10:23,000 开始 (第89条)
            ("second_night", "00:11:19,850"), # 第二夜从 SRT 00:22:50,450 开始 (第180条)
            ("second_day", "00:11:37,410"), # 第二天从 SRT 00:23:03,490 开始 (第181条)
            ("end_time", "00:34:01,170") # 游戏在 SRT 00:49:36,630 结束 (第380条)
        ]),
        "user_aliases": { # SRT中的发言人ID -> 别名数组
            "说话人 1": ["host"], 
            "说话人 2": ["4号"],
            "说话人 3": ["8号"],
            "说话人 4": ["11号"],
            "说话人 5": ["12号"],
            "说话人 6": ["2号"],
            "说话人 7": ["5号"],
            "说话人 8": ["6号"],
            "说话人 9": ["10号"],
            "说话人 10": ["1号"],
            "说话人 11": ["9号"],
            "说话人 12": ["7号"], # 主持人
            "说话人 13": ["3号"]
        },
        "real_role": { # (基于 SRT 第 381-382 条复盘)
            "说话人 1": "host",   
            "说话人 2": "村民",   
            "说话人 3": "女巫",   
            "说话人 4": "狼人",    
            "说话人 5": "村民", 
            "说话人 6": "狼人",    
            "说话人 7": "预言家",    
            "说话人 8": "魔术师",  
            "说话人 9": "猎人",   
            "说话人 10": "狼人",   
            "说话人 11": "村民",    
            "说话人 12": "村民",    
            "说话人 13": "狼人"  
        },
        "MVP": {
            "id": "5号",
            "votes": {
                "second_day_votes": {
                    "vote_to": "2号",
                    "cut_off_time": 269
                }
            }
        },
        "logs":"1 号、2 号、3 号、11 号为狼人，5 号为预言家，6 号为魔术师，8 号为女巫，10 号为猎人，4 号、7 号、9 号、12 号为村民；警长竞选 1、5、6、8、10、11 号参与，5 号查杀 11 号称先验 4 号再验 9 号，8 号称自己是好人上警调整频率觉得 5 号还行给 2 号丢压力，3 号跳女巫说 6 号是银水求魔术师保护，9 号认为 8 号是真女巫 6 号是真银水 5 号还行让 11 号自救，4 号跳预言家说 6 号是金水认为 5 号悍跳 10 号可能是狼要验 10 和 12 号，10 号先中立后站边 5 号，9 号退水后 5 号和 11 号留任；首夜狼人刀 6 号，女巫 8 号开药解救；白天 4 号说 11 号做不成预言家建议出 11 号验 7 或 2 号指出 1 号发言奇怪，1 号自爆；第二夜狼人刀 8 号，女巫 8 号毒死 11 号；天亮后 8 号和 11 号死亡，6 号跳魔术师站边 5 号说狼人应交牌，7 号说自己上票给 5 号是好人分析 4 号让 5 号验自己不好 1 号是听杀牌打 9 和 12 号，9 号说自己是平民反驳 7 号认为 7、11 是狼 12、3 里出一狼，5 号归票建议出 2 号拉 2 号和 7 号 PK；投票时 3、4 号投 3 号其余投 2 号 2 号出局，6 号说 3 号是最后一狼狼人交牌，游戏结束好人获胜。" # 按要求：留空或手动填写
    },
    
    # 2. 警长任命 
    "sheriff_appointments": {
        "说话人 7": "00:09:23,720"
    },
    
    # 3. 摘要提取范围
    # (按要求：从第 381 条到第 398 条)
    "summary_id_range": (272,278 )
}