GAME_CONFIG = {
    # 1. 元数据 (在 'metadata' 键下)
    "metadata": {
        "game_id": "7",
        "source": "Pandakill Season 3, Episode 7",
        "game_rules": "", # 按要求：留空或手动填写规则
        "game_roles": [ # 填写此板子中的所有角色
            "预言家",
            "女巫",
            "守卫",
            "猎人",
            "狼人",
            "恶魔",
            "村民"
        ],
        "game_status": OrderedDict([ # 必须按时间顺序填写！
            ("first_night", "00:08:38,000"), # 游戏从SRT 00:00:00,120 开始
            ("sheiff_election", "00:08:59,400"), # 警长竞选从 SRT 00:03:35,500 开始 (第44条)
            ("first_day", "00:26:10,460"), # 第一个白天发言从 SRT 00:10:23,000 开始 (第89条)
            ("second_night", "01:11:13,250"), # 第二夜从 SRT 00:22:50,450 开始 (第180条)
            ("second_day", "01:11:39,500"), # 第二天从 SRT 00:23:03,490 开始 (第181条)
            ("third_night", "01:12:01,770"), # (估算值，基于第306条遗言结束)
            ("third_day", "01:12:33,900"),   # 第三天从 SRT 00:41:39,700 开始 (第310条)
            ("fourth_night", "01:17:16,520"), # (估算值，基于第340条遗言结束)
            ("fourth_day", "01:17:34,880"),   # 第四
            ("end_time", "01:21:03,660") # 游戏在 SRT 00:49:36,630 结束 (第380条)
        ]),
        "user_aliases": { # SRT中的发言人ID -> 别名数组
            "说话人 1": ["host"], 
            "说话人 2": ["5号"],
            "说话人 3": ["8号"],
            "说话人 4": ["4号"],
            "说话人 5": ["12号"],
            "说话人 6": ["10号"],
            "说话人 7": ["1号"],
            "说话人 8": ["6号"],
            "说话人 9": ["3号"],
            "说话人 10": ["7号"],
            "说话人 11": ["2号"],
            "说话人 12": ["11号"], # 主持人
            "说话人 13": ["9号"]
        },
        "real_role": { # (基于 SRT 第 381-382 条复盘)
            "说话人 1": "host",   
            "说话人 2": "预言家",   
            "说话人 3": "村民",   
            "说话人 4": "狼人",    
            "说话人 5": "女巫", 
            "说话人 6": "狼人",    
            "说话人 7": "村民",    
            "说话人 8": "村民",  
            "说话人 9": "猎人",   
            "说话人 10": "狼人",   
            "说话人 11": "恶魔",    
            "说话人 12": "守卫",    
            "说话人 13": "村民" 
        },
        "MVP": {
            "id": "5号",
            "votes": {

            }
        },
        "logs":"1 号村民，2 号恶魔，3 号猎人，4 号狼人，5 号预言家，6 号村民，7 号狼人，8 号村民，9 号村民，10 号狼人，11 号守卫，12 号女巫；警长竞选阶段 1、3、4、5、7、10、11、12 号参与，10 号发 3 号查杀，4 号跳预言家给 8 号金水、警徽流 12、6，5 号跳预言家给 7 号查杀、警徽流先投 4 者、10，5 号当选警长；白天发言阶段 6 号上票 5 号，10 号帮 4 号号票，3 号是 4 号金水，9 号站边 5 号，12 号站边 5 号、建议改警徽流，2 号跳女巫、怀疑 7 号自刀，9 号盘狼坑二、四、七、十，4 号重申预言家；夜间行动第一晚狼人首刀 11 号、12 号用解药平安夜，第二晚狼人刀 9 号、2 号毒 9 号，第三晚狼人刀 1 号，第四晚狼人刀 5 号；10 号、7 号、4 号先后自爆；最后 2 号交牌，好人获胜" # 按要求：留空或手动填写
    },
    
    # 2. 警长任命 
    "sheriff_appointments": {
        "说话人 2": "00:25:48,530"
    },
    
    # 3. 摘要提取范围
    # (按要求：从第 381 条到第 398 条)
    "summary_id_range": (542, 549)
}