GAME_CONFIG = {
    # 1. 元数据 (在 'metadata' 键下)
    "metadata": {
        "game_id": "10",
        "source": "Pandakill Season 3, Episode 10",
        "game_rules": "", # 按要求：留空或手动填写规则
        "game_roles": [ # 填写此板子中的所有角色
            "预言家",
            "女巫",
            "守卫",
            "猎人",
            "狼人",
            "恶魔",
            "村民"
        ],
        "game_status": OrderedDict([ # 必须按时间顺序填写！
            ("first_night", "00:07:19,910"), # 游戏从SRT 00:00:00,120 开始
            ("sheiff_election", "00:07:41,120"), # 警长竞选从 SRT 00:03:35,500 开始 (第44条)
            ("first_day", "00:24:52,950"), # 第一个白天发言从 SRT 00:10:23,000 开始 (第89条)
            ("second_night", "01:15:53,160"), # 第二夜从 SRT 00:22:50,450 开始 (第180条)
            ("second_day", "01:16:20,470"), # 第二天从 SRT 00:23:03,490 开始 (第181条)
            ("third_night", "01:21:40,270"), # (估算值，基于第306条遗言结束)
            ("third_day", "01:22:09,070"),   # 第三天从 SRT 00:41:39,700 开始 (第310条)
            ("end_time", "01:34:32,310") # 游戏在 SRT 00:49:36,630 结束 (第380条)
        ]),
        "user_aliases": { # SRT中的发言人ID -> 别名数组
            "说话人 1": ["8号"], 
            "说话人 2": ["host"],
            "说话人 3": ["7号"],
            "说话人 4": ["5号"],
            "说话人 5": ["10号"],
            "说话人 6": ["2号"],
            "说话人 7": ["12号"],
            "说话人 8": ["11号"],
            "说话人 9": ["6号"],
            "说话人 10": ["3号"],
            "说话人 11": ["9号"],
            "说话人 12": ["1号"], # 主持人
            "说话人 13": ["4号"],
        },
        "real_role": { # (基于 SRT 第 381-382 条复盘)
            "说话人 1": "村民",   
            "说话人 2": "host",   
            "说话人 3": "村民",   
            "说话人 4": "预言家",    
            "说话人 5": "村民", 
            "说话人 6": "守卫",    
            "说话人 7": "狼人",    
            "说话人 8": "女巫",  
            "说话人 9": "猎人",   
            "说话人 10": "村民",   
            "说话人 11": "恶魔",    
            "说话人 12": "狼人",    
            "说话人 13": "狼人"  
        },
        "MVP": {
            "id": "11号",
            "votes": {
                "first_day_votes": {
                    "vote_to": "12号",
                    "cut_off_time": 591
                }
            }
        },
        "logs":"1 号是狼人，参与警长竞选，上票 4 号，第二晚后发言称若自己出局游戏结束，随后自爆；2 号是守卫，两轮投 5 号，第二晚被狼刀死亡；3 号是村民，第一轮投 4 号，第二轮弃票，发言称自己是平民，提议出 9 号；4 号是狼人，跳预言家查杀 12 号，当选警长，第二晚被女巫毒死亡；5 号是预言家，跳预言家查杀 12 号，验 1 号是查杀，呼吁好人投 12 号；6 号是猎人，成为警长，选择从警右发言；7 号是村民，参与警长竞选，质疑 5 号预言家身份，发言称会在 5、12 里投票；8 号是村民，跳女巫称救 7 号，第三晚被狼刀死亡；9 号是恶魔，参与警长竞选，认为 5 号发言不好，站边 4 号，最后被提议出局；10 号是村民，参与警长竞选，力挺 4 号，发言称自己是平民；11 号是女巫，跳女巫称救 7 号，站边 4 号，毒 4 号；12 号是狼人，参与警长竞选，被 5 号查杀，出局留遗言称自己是平民。" # 按要求：留空或手动填写
    },
    
    # 2. 警长任命 
    "sheriff_appointments": {
        "说话人 13": "00:24:20,610",
        "说话人 9": "01:16:29,750"
    },
    
    # 3. 摘要提取范围
    # (按要求：从第 381 条到第 398 条)
    "summary_id_range": (780, 788)
}