GAME_CONFIG = {
    # 1. 元数据 (在 'metadata' 键下)
    "metadata": {
        "game_id": "11",
        "source": "Pandakill Season 3, Episode 4",
        "game_rules": "", # 按要求：留空或手动填写规则
        "game_roles": [ # 填写此板子中的所有角色
            "预言家",
            "女巫",
            "守卫",
            "猎人",
            "狼人",
            "恶魔",
            "村民"
        ],
        "game_status": OrderedDict([ # 必须按时间顺序填写！
            ("first_night", "00:00:43,940"), # 游戏从SRT 00:00:00,120 开始
            ("sheiff_election", "00:01:12,130"), # 警长竞选从 SRT 00:03:35,500 开始 (第44条)
            ("first_day", "00:11:08,980"), # 第一个白天发言从 SRT 00:10:23,000 开始 (第89条)
            ("second_night", "00:50:06,850"), # 第二夜从 SRT 00:22:50,450 开始 (第180条)
            ("second_day", "00:50:06,850"), # 第二天从 SRT 00:23:03,490 开始 (第181条)
            ("third_night", "00:51:00,450"), # (估算值，基于第306条遗言结束)
            ("third_day", "00:51:23,460"),   # 第三天从 SRT 00:41:39,700 开始 (第310条)
            ("end_time", "00:51:23,460") # 游戏在 SRT 00:49:36,630 结束 (第380条)
        ]),
        "user_aliases": { # SRT中的发言人ID -> 别名数组
            "说话人 1": ["host"], 
            "说话人 2": ["12号"],
            "说话人 3": ["2号"],
            "说话人 4": ["7号"],
            "说话人 5": ["6号"],
            "说话人 6": ["11号"],
            "说话人 7": ["8号"],
            "说话人 8": ["5号"],
            "说话人 9": ["9号"],
            "说话人 10": ["10号"],
            "说话人 11": ["1号"],
            "说话人 12": ["3号"], # 主持人
            "说话人 13": ["4号"],
        },
        "real_role": { # (基于 SRT 第 381-382 条复盘)
            "说话人 1": "host",   
            "说话人 2": "村民",   
            "说话人 3": "狼人",   
            "说话人 4": "狼人",    
            "说话人 5": "女巫", 
            "说话人 6": "村民",    
            "说话人 7": "预言家",    
            "说话人 8": "村民",  
            "说话人 9": "狼人",   
            "说话人 10": "恶魔",   
            "说话人 11": "守卫",    
            "说话人 12": "村民",    
            "说话人 13": "猎人"   
        },
        "MVP": {
            "id": "1号",
            "votes": {
                "first_day_votes": {
                    "vote_to": "2号",
                    "cut_off_time": 378
                }
            }
        },
        "logs":"1 号是守卫，2 号是狼人，3 号是猎人，4 号是村民，5 号是村民，6 号是女巫，7 号是狼人，8 号是预言家，9 号是狼人，10 号是恶魔，11 号是村民，12 号是村民；警长竞选阶段 2、5、6、7、8、11、12 号参与竞选，8 号发言给 5 号发金水警徽流先 10 后 11，6 号存疑留退水，2 号怀疑 8、11 是狼，5 号站边 8 号说 2 号是悍跳，4 号跳女巫又退水，6 号退水，8 号当选警长；白天讨论 9 号怀疑 12、2 是狼，10 号建议出 2 号警徽流验 6、11，6 号认为 7 是女巫怀疑 9、10，2 号解释站边怀疑 9、10，11 号认为 12 是好人怀疑 6，3 号解释井上行为怀疑 12、10，12 号认为 2 是狼怀疑 9、10，8 号归票 2 号，投票结果 2 号出局；2 号遗言说是平民炸出 7 号狼建议警徽流先 10 后 11；夜间第一晚平安夜女巫救 4 号，第二晚狼人刀 3 号，3 号开枪带走 6 号，女巫毒 9 号，7 号自爆；第三晚狼刀 8 号，守卫守 8 号平安夜，最后恶魔交牌好人获胜。" # 按要求：留空或手动填写
    },
    
    # 2. 警长任命 
    "sheriff_appointments": {
        "说话人 7": "00:10:54,590"
    },
    
    # 3. 摘要提取范围
    # (按要求：从第 381 条到第 398 条)
    "summary_id_range": (412, 418)
}