GAME_CONFIG = {
    # 1. 元数据 (在 'metadata' 键下)
    "metadata": {
        "game_id": "17",
        "source": "Pandakill Season 3, Episode 6",
        "game_rules": "", # 按要求：留空或手动填写规则
        "game_roles": [ # 填写此板子中的所有角色
            "预言家",
            "女巫",
            "猎人",
            "九尾妖狐",
            "狼人",
            "村民"
        ],
        "game_status": OrderedDict([ # 必须按时间顺序填写！
            ("first_night", "00:00:40,640"), # 游戏从SRT 00:00:00,120 开始
            ("sheiff_election", "00:00:40,640"), # 警长竞选从 SRT 00:03:35,500 开始 (第44条)
            ("first_day", "00:00:40,640"), # 第一个白天发言从 SRT 00:10:23,000 开始 (第89条)
            ("second_night", "00:05:30,430"), # 第二夜从 SRT 00:22:50,450 开始 (第180条)
            ("second_day", "00:05:30,430"), # 第二天从 SRT 00:23:03,490 开始 (第181条)
            ("third_night", "00:06:02,620"), # (估算值，基于第306条遗言结束)
            ("third_day", "00:06:23,450"),   # 第三天从 SRT 00:41:39,700 开始 (第310条)
            ("fourth_night", "00:16:28,220"), # (估算值，基于第306条遗言结束)
            ("fourth_day", "00:16:47,520"),   # 第三
            ("end_time", "00:28:10,470") # 游戏在 SRT 00:49:36,630 结束 (第380条)
        ]),
        "user_aliases": { # SRT中的发言人ID -> 别名数组
            "说话人 1": ["host"], 
            "说话人 2": ["10号"],
            "说话人 3": ["9号"],
            "说话人 4": ["2号"],
            "说话人 5": ["12号"],
            "说话人 6": ["1号"],
            "说话人 7": ["4号"],
            "说话人 8": ["5号"],
            "说话人 9": ["7号"],
            "说话人 10": ["6号"],
            "说话人 11": ["3号"],
            "说话人 12": ["8号"], # 主持人
            "说话人 13": ["11号"]
        },
        "real_role": { # (基于 SRT 第 381-382 条复盘)
            "说话人 1": "host",   
            "说话人 2": "村民",   
            "说话人 3": "预言家",   
            "说话人 4": "九尾妖狐",    
            "说话人 5": "女巫", 
            "说话人 6": "村民",    
            "说话人 7": "狼人",    
            "说话人 8": "村民",  
            "说话人 9": "狼人",   
            "说话人 10": "猎人",   
            "说话人 11": "村民",    
            "说话人 12": "狼人",    
            "说话人 13": "狼人" 
        },
        "MVP": {
            "id": "12号",
            "votes": {
                "fourth_day_votes": {
                    "vote_to": "7号",
                    "cut_off_time": 236
                }
            }
        },
        "logs":"1 号是村民，参与警长竞选，第二晚被女巫 12 号盲毒死亡；2 号是九尾妖狐，参与警长竞选并跳身份，称得到 9 条尾巴，怀疑狼自刀，认为 1 号逻辑乱，第二晚被狼刀死亡；3 号是村民，第三晚被狼刀死亡；4 号是狼人，参与警长竞选，被 8 号跳预言家查杀后自爆；5 号是村民，跳女巫称银水是 5 号，盲毒 1 号，分析局势认为 3 号大概率是预言家，10 号可能是好人；6 号是猎人，参与警长竞选，发言认为 12 号是好人，11 号被查杀后笑可能是狼，7、9 号开心可能是好人，10 号可能是好人，呼吁狼人焊跳，后期跳猎人认为 7 号是狼，推测最后一狼在 7、9 号；7 号是狼人，参与警长竞选，跳预言家称验 10、2 号金水，今晚验 9 号，最后被投票出局；8 号是狼人，参与警长竞选，自爆宣布平安夜，后跳预言家查杀 4 号；9 号是预言家，参与警长竞选，后期跳预言家查杀 7 号；10 号是村民，发言怀疑 12 号是否预言家，分析 1、2 号死亡可能是女巫毒 1 号，第四晚被狼刀死亡；11 号是狼人，参与警长竞选，自爆导致无警长；12 号是女巫，参与警长竞选，第一个发言跳预言家查杀 11 号，警徽流 1、8 号，首夜开药解救被刀村民形成平安夜，第二晚盲毒 1 号，后期跳女巫分析局势。" # 按要求：留空或手动填写
    },
    
    # 2. 警长任命 
    "sheriff_appointments": {
    },
    
    # 3. 摘要提取范围
    # (按要求：从第 381 条到第 398 条)
    "summary_id_range": (237, 246)
}